espressif/esp-wifi-remote/components/esp_wifi_remote/examples/sdkconfig.ci.hosted_slave
# CI config for the esp_hosted coprocessor firmware.
#
# Built from the esp_hosted "wifi/sta/cp" example (Wi-Fi station coprocessor).
# Only the target is pinned here; the example's own sdkconfig.defaults and
# sdkconfig.defaults.esp32c6 already select the correct SDIO pins
# (CMD=18, CLK=19, D0..D3=20..23) and the OTA partition table
# (partitions_eh_cp_ota_4m.csv), matching the ESP32-P4-Function-EV-Board host.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_FREERTOS_HZ=1000
